In [1]:
import pandas as pd
import numpy as np

In [2]:
g7_pop = pd.Series([35.467, 63.951, 80.940, 60.665, 127.061, 64.511, 318.523])

In [3]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

In [4]:
# in millions
g7_pop.name ='G7 Population in million'
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 Population in million, dtype: float64

In [5]:
g7_pop.values

array([ 35.467,  63.951,  80.94 ,  60.665, 127.061,  64.511, 318.523])

In [6]:
type(g7_pop.values)

numpy.ndarray

In [7]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [8]:
g7_pop[1]

63.951

In [9]:
g7_pop[[1, 3]]

1    63.951
3    60.665
Name: G7 Population in million, dtype: float64

In [10]:
g7_pop.index = [
    'Canada',
    'France',
    'Egypt',
    'Ghana',
    'Russia',
    'Germany',
    'United-State'
]

In [11]:
g7_pop

Canada           35.467
France           63.951
Egypt            80.940
Ghana            60.665
Russia          127.061
Germany          64.511
United-State    318.523
Name: G7 Population in million, dtype: float64

In [12]:
g7_pop['Ghana']

60.665

In [13]:
g7_pop.sum()

751.118

In [14]:
g7_pop.mean()

107.30257142857144

In [15]:
g7_pop.iloc[4]

127.061

In [16]:
g7_pop[4]

127.061

In [17]:
g7_pop[['Ghana', 'France']]

Ghana     60.665
France    63.951
Name: G7 Population in million, dtype: float64

In [18]:
l = ['a', 'b', 'c']
l

['a', 'b', 'c']

In [19]:
l[:2]

['a', 'b']

In [20]:
del l[3:]

In [21]:
l.append(('d', 'e'))

In [22]:
g7_pop

Canada           35.467
France           63.951
Egypt            80.940
Ghana            60.665
Russia          127.061
Germany          64.511
United-State    318.523
Name: G7 Population in million, dtype: float64

In [23]:
g7_pop * 100000

Canada           3546700.0
France           6395100.0
Egypt            8094000.0
Ghana            6066500.0
Russia          12706100.0
Germany          6451100.0
United-State    31852300.0
Name: G7 Population in million, dtype: float64

In [24]:
g7_pop.mean()

107.30257142857144

In [25]:
g7_pop[g7_pop > g7_pop.mean()]

Russia          127.061
United-State    318.523
Name: G7 Population in million, dtype: float64

In [26]:
g7_pop[g7_pop > 4000000]

Series([], Name: G7 Population in million, dtype: float64)

In [27]:
g7_pop < 400000

Canada          True
France          True
Egypt           True
Ghana           True
Russia          True
Germany         True
United-State    True
Name: G7 Population in million, dtype: bool

In [28]:
g7_pop.name = 'G7 Population in Millions'
g7_pop.name

'G7 Population in Millions'

In [29]:
g7_pop.std()

97.24996987121581

In [31]:
~ not
| or
& and

SyntaxError: invalid syntax (<ipython-input-31-7f2c481b21e8>, line 1)

In [1]:
g7_pop[(g7_pop > g7_pop.mean() - g7_pop.std()/2) | (g7_pop > g7_pop.mean() - g7_pop.std()/2)]

NameError: name 'g7_pop' is not defined

In [ ]:
np.log(g7_pop)

In [ ]:
g7_pop[(g7_pop > 80) | (g7_pop < 40)]

In [ ]:
g7_pop[(g7_pop > 80) & (g7_pop < 200)]

In [ ]:
g7_pop['Canada'] = 200
g7_pop

In [32]:
g7_pop.iloc[-1] = 400
g7_pop

Canada           35.467
France           63.951
Egypt            80.940
Ghana            60.665
Russia          127.061
Germany          64.511
United-State    400.000
Name: G7 Population in Millions, dtype: float64

In [33]:
g7_pop[g7_pop < 90] = 100
g7_pop

Canada          100.000
France          100.000
Egypt           100.000
Ghana           100.000
Russia          127.061
Germany         100.000
United-State    400.000
Name: G7 Population in Millions, dtype: float64

In [34]:
np.array([np.random.randn(5)])

array([[-0.13368174,  0.04064301,  0.06439625, -0.25857866, -0.12011377]])

In [35]:
df = pd.DataFrame({
    'Population' : [35.487, 63.951, 80.94, 60.665, 127.061, 64.511, 318.523],
    'GDP' : [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area' : [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI' : [
        0.915,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent' : [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, index=[
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States'
])

In [36]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.487   1785387       9984670  0.915   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [37]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'], dtype='object')

In [38]:
df.index

Index(['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
      dtype='object')

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [40]:
df.size

35

In [41]:
df.shape

(7, 5)

In [42]:
df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.305429  5.080248e+06  3.061327e+06  0.900714
std     97.247508  5.494020e+06  4.576187e+06  0.016859
min     35.487000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.915000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [43]:
df.dtypes

Population      float64
GDP               int64
Surface Area      int64
HDI             float64
Continent        object
dtype: object

In [44]:
df.dtypes.value_counts()

float64    2
int64      2
object     1
dtype: int64

In [45]:
df.iloc[-1]

Population       318.523
GDP             17348075
Surface Area     9525067
HDI                0.915
Continent        America
Name: United States, dtype: object

In [46]:
df.loc['Japan']

Population      127.061
GDP             4602367
Surface Area     377930
HDI               0.891
Continent          Asia
Name: Japan, dtype: object

In [47]:
df['HDI']

Canada            0.915
France            0.888
Germany           0.916
Italy             0.873
Japan             0.891
United Kingdom    0.907
United States     0.915
Name: HDI, dtype: float64

In [48]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.487   1785387       9984670  0.915   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [49]:
df.loc['France' : 'Japan', ['GDP', 'HDI']]

             GDP    HDI
France   2833687  0.888
Germany  3874437  0.916
Italy    2167744  0.873
Japan    4602367  0.891

In [50]:
df.iloc[[0, 2, -2], [1, -2]]

                    GDP    HDI
Canada          1785387  0.915
Germany         3874437  0.916
United Kingdom  2950039  0.907

In [51]:
df['Population'] > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: Population, dtype: bool

In [52]:
df.loc[df['Population'] > 70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [53]:
df.loc[df['Population'] > 70, 'Population']

Germany           80.940
Japan            127.061
United States    318.523
Name: Population, dtype: float64

In [54]:
df.loc[df['Population'] > 70, ['Population', 'GDP']]

               Population       GDP
Germany            80.940   3874437
Japan             127.061   4602367
United States     318.523  17348075

In [55]:
df.drop(['Canada'])

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [56]:
df.drop(['Italy', 'France'])

                Population       GDP  Surface Area    HDI Continent
Canada              35.487   1785387       9984670  0.915   America
Germany             80.940   3874437        357114  0.916    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [57]:
df.drop(columns=['Population', 'Surface Area'])

                     GDP    HDI Continent
Canada           1785387  0.915   America
France           2833687  0.888    Europe
Germany          3874437  0.916    Europe
Italy            2167744  0.873    Europe
Japan            4602367  0.891      Asia
United Kingdom   2950039  0.907    Europe
United States   17348075  0.915   America

In [58]:
df.drop(['Canada', 'Italy'], axis=0)

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [59]:
df.drop(['Continent', 'GDP'], axis='columns')

                Population  Surface Area    HDI
Canada              35.487       9984670  0.915
France              63.951        640679  0.888
Germany             80.940        357114  0.916
Italy               60.665        301336  0.873
Japan              127.061        377930  0.891
United Kingdom      64.511        242495  0.907
United States      318.523       9525067  0.915

In [60]:
df[['Population', 'GDP']]

                Population       GDP
Canada              35.487   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [61]:
df[['Population', 'GDP']] / 100

                Population        GDP
Canada             0.35487   17853.87
France             0.63951   28336.87
Germany            0.80940   38744.37
Italy              0.60665   21677.44
Japan              1.27061   46023.67
United Kingdom     0.64511   29500.39
United States      3.18523  173480.75

In [62]:
crises = pd.Series([-1000000, -0.3], index=['GDP', 'HDI'])
crises

GDP   -1000000.0
HDI         -0.3
dtype: float64

In [63]:
df[['GDP', 'HDI']]

                     GDP    HDI
Canada           1785387  0.915
France           2833687  0.888
Germany          3874437  0.916
Italy            2167744  0.873
Japan            4602367  0.891
United Kingdom   2950039  0.907
United States   17348075  0.915

In [64]:
df[['GDP', 'HDI']] + crises

                       GDP    HDI
Canada            785387.0  0.615
France           1833687.0  0.588
Germany          2874437.0  0.616
Italy            1167744.0  0.573
Japan            3602367.0  0.591
United Kingdom   1950039.0  0.607
United States   16348075.0  0.615

In [65]:
langs = pd.Series(['French', 'German', 'Italian'],
                index=['France', 'Germany', 'Italy'],
                 name='Language')
df['Language'] = langs
df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.487   1785387       9984670  0.915   America      NaN
France              63.951   2833687        640679  0.888    Europe   French
Germany             80.940   3874437        357114  0.916    Europe   German
Italy               60.665   2167744        301336  0.873    Europe  Italian
Japan              127.061   4602367        377930  0.891      Asia      NaN
United Kingdom      64.511   2950039        242495  0.907    Europe      NaN
United States      318.523  17348075       9525067  0.915   America      NaN

In [66]:
holiday = pd.Series(['Christmas', 'New Year', 'Valentine'],
                index=['Canada', 'Germany', 'United States'],
                   name='Holyds')
df['Holidays'] = holiday
df

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
Canada,35.487,1785387,9984670,0.915,America,NaN,Christmas
France,63.951,2833687,640679,0.888,Europe,French,NaN
Germany,80.940,3874437,357114,0.916,Europe,German,New Year
Italy,60.665,2167744,301336,0.873,Europe,Italian,NaN
Japan,127.061,4602367,377930,0.891,Asia,NaN,NaN
United Kingdom,64.511,2950039,242495,0.907,Europe,NaN,NaN
United States,318.523,17348075,9525067,0.915,America,NaN,Valentine

In [67]:
df['Holidays']

Canada            Christmas
France                  NaN
Germany            New Year
Italy                   NaN
Japan                   NaN
United Kingdom          NaN
United States     Valentine
Name: Holidays, dtype: object

In [68]:
df['Language'] = 'English'
df

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
Canada,35.487,1785387,9984670,0.915,America,English,Christmas
France,63.951,2833687,640679,0.888,Europe,English,NaN
Germany,80.940,3874437,357114,0.916,Europe,English,New Year
Italy,60.665,2167744,301336,0.873,Europe,English,NaN
Japan,127.061,4602367,377930,0.891,Asia,English,NaN
United Kingdom,64.511,2950039,242495,0.907,Europe,English,NaN
United States,318.523,17348075,9525067,0.915,America,English,Valentine

In [69]:
df.rename(columns={'Language' : 'LanguageRename'})

,Population,GDP,Surface Area,HDI,Continent,LanguageRename,Holidays
Canada,35.487,1785387,9984670,0.915,America,English,Christmas
France,63.951,2833687,640679,0.888,Europe,English,NaN
Germany,80.940,3874437,357114,0.916,Europe,English,New Year
Italy,60.665,2167744,301336,0.873,Europe,English,NaN
Japan,127.061,4602367,377930,0.891,Asia,English,NaN
United Kingdom,64.511,2950039,242495,0.907,Europe,English,NaN
United States,318.523,17348075,9525067,0.915,America,English,Valentine

In [70]:
df.rename(index=str.lower)

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
canada,35.487,1785387,9984670,0.915,America,English,Christmas
france,63.951,2833687,640679,0.888,Europe,English,NaN
germany,80.940,3874437,357114,0.916,Europe,English,New Year
italy,60.665,2167744,301336,0.873,Europe,English,NaN
japan,127.061,4602367,377930,0.891,Asia,English,NaN
united kingdom,64.511,2950039,242495,0.907,Europe,English,NaN
united states,318.523,17348075,9525067,0.915,America,English,Valentine

In [71]:
df.rename(index=str.upper)

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
CANADA,35.487,1785387,9984670,0.915,America,English,Christmas
FRANCE,63.951,2833687,640679,0.888,Europe,English,NaN
GERMANY,80.940,3874437,357114,0.916,Europe,English,New Year
ITALY,60.665,2167744,301336,0.873,Europe,English,NaN
JAPAN,127.061,4602367,377930,0.891,Asia,English,NaN
UNITED KINGDOM,64.511,2950039,242495,0.907,Europe,English,NaN
UNITED STATES,318.523,17348075,9525067,0.915,America,English,Valentine

In [72]:
df.rename(index=lambda x: x.lower())

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
canada,35.487,1785387,9984670,0.915,America,English,Christmas
france,63.951,2833687,640679,0.888,Europe,English,NaN
germany,80.940,3874437,357114,0.916,Europe,English,New Year
italy,60.665,2167744,301336,0.873,Europe,English,NaN
japan,127.061,4602367,377930,0.891,Asia,English,NaN
united kingdom,64.511,2950039,242495,0.907,Europe,English,NaN
united states,318.523,17348075,9525067,0.915,America,English,Valentine

In [73]:
df

,Population,GDP,Surface Area,HDI,Continent,Language,Holidays
Canada,35.487,1785387,9984670,0.915,America,English,Christmas
France,63.951,2833687,640679,0.888,Europe,English,NaN
Germany,80.940,3874437,357114,0.916,Europe,English,New Year
Italy,60.665,2167744,301336,0.873,Europe,English,NaN
Japan,127.061,4602367,377930,0.891,Asia,English,NaN
United Kingdom,64.511,2950039,242495,0.907,Europe,English,NaN
United States,318.523,17348075,9525067,0.915,America,English,Valentine

In [74]:
df.rename(index=(str.upper), columns=(str.upper))

,POPULATION,GDP,SURFACE AREA,HDI,CONTINENT,LANGUAGE,HOLIDAYS
CANADA,35.487,1785387,9984670,0.915,America,English,Christmas
FRANCE,63.951,2833687,640679,0.888,Europe,English,NaN
GERMANY,80.940,3874437,357114,0.916,Europe,English,New Year
ITALY,60.665,2167744,301336,0.873,Europe,English,NaN
JAPAN,127.061,4602367,377930,0.891,Asia,English,NaN
UNITED KINGDOM,64.511,2950039,242495,0.907,Europe,English,NaN
UNITED STATES,318.523,17348075,9525067,0.915,America,English,Valentine

In [75]:
df.drop('Language', axis=1, inplace=True)

In [76]:
df

                Population       GDP  Surface Area    HDI Continent   Holidays
Canada              35.487   1785387       9984670  0.915   America  Christmas
France              63.951   2833687        640679  0.888    Europe        NaN
Germany             80.940   3874437        357114  0.916    Europe   New Year
Italy               60.665   2167744        301336  0.873    Europe        NaN
Japan              127.061   4602367        377930  0.891      Asia        NaN
United Kingdom      64.511   2950039        242495  0.907    Europe        NaN
United States      318.523  17348075       9525067  0.915   America  Valentine

In [77]:
df.append(pd.Series({
    'Population':5,
    "GDP":10
}, name='China', copy=True))

,Population,GDP,Surface Area,HDI,Continent,Holidays
Canada,35.487,1785387.0,9984670.0,0.915,America,Christmas
France,63.951,2833687.0,640679.0,0.888,Europe,NaN
Germany,80.940,3874437.0,357114.0,0.916,Europe,New Year
Italy,60.665,2167744.0,301336.0,0.873,Europe,NaN
Japan,127.061,4602367.0,377930.0,0.891,Asia,NaN
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,NaN
United States,318.523,17348075.0,9525067.0,0.915,America,Valentine
China,5.000,10.0,NaN,NaN,NaN,NaN

In [78]:
df

                Population       GDP  Surface Area    HDI Continent   Holidays
Canada              35.487   1785387       9984670  0.915   America  Christmas
France              63.951   2833687        640679  0.888    Europe        NaN
Germany             80.940   3874437        357114  0.916    Europe   New Year
Italy               60.665   2167744        301336  0.873    Europe        NaN
Japan              127.061   4602367        377930  0.891      Asia        NaN
United Kingdom      64.511   2950039        242495  0.907    Europe        NaN
United States      318.523  17348075       9525067  0.915   America  Valentine

In [79]:
df.loc['China'] = pd.Series({'Population':10, 'GDP':10})
df

,Population,GDP,Surface Area,HDI,Continent,Holidays
Canada,35.487,1785387.0,9984670.0,0.915,America,Christmas
France,63.951,2833687.0,640679.0,0.888,Europe,NaN
Germany,80.940,3874437.0,357114.0,0.916,Europe,New Year
Italy,60.665,2167744.0,301336.0,0.873,Europe,NaN
Japan,127.061,4602367.0,377930.0,0.891,Asia,NaN
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,NaN
United States,318.523,17348075.0,9525067.0,0.915,America,Valentine
China,10.000,10.0,NaN,NaN,NaN,NaN

In [80]:
# df.drop('China', inplace=True)
df

,Population,GDP,Surface Area,HDI,Continent,Holidays
Canada,35.487,1785387.0,9984670.0,0.915,America,Christmas
France,63.951,2833687.0,640679.0,0.888,Europe,NaN
Germany,80.940,3874437.0,357114.0,0.916,Europe,New Year
Italy,60.665,2167744.0,301336.0,0.873,Europe,NaN
Japan,127.061,4602367.0,377930.0,0.891,Asia,NaN
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,NaN
United States,318.523,17348075.0,9525067.0,0.915,America,Valentine
China,10.000,10.0,NaN,NaN,NaN,NaN

In [81]:
df['GDP']/df['Population']

Canada            50311.015301
France            44310.284437
Germany           47868.013343
Italy             35733.025633
Japan             36221.712406
United Kingdom    45729.239975
United States     54464.120330
China                 1.000000
dtype: float64

In [82]:
df['GDP per Capita'] = df['GDP']/df['Population']
df

,Population,GDP,Surface Area,HDI,Continent,Holidays,GDP per Capita
Canada,35.487,1785387.0,9984670.0,0.915,America,Christmas,50311.015301
France,63.951,2833687.0,640679.0,0.888,Europe,NaN,44310.284437
Germany,80.940,3874437.0,357114.0,0.916,Europe,New Year,47868.013343
Italy,60.665,2167744.0,301336.0,0.873,Europe,NaN,35733.025633
Japan,127.061,4602367.0,377930.0,0.891,Asia,NaN,36221.712406
United Kingdom,64.511,2950039.0,242495.0,0.907,Europe,NaN,45729.239975
United States,318.523,17348075.0,9525067.0,0.915,America,Valentine,54464.120330
China,10.000,10.0,NaN,NaN,NaN,NaN,1.000000

In [83]:
excel_df = pd.read_excel('btc-market-price.xlsx')
excel_df.head(5)

        Date        Value
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [84]:
excel_df.rename(columns={'Date':'Timestamp', 'Value':'Price'}, inplace=True)

In [85]:
excel_df.head(5)

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [86]:
excel_df.shape

(365, 2)

In [87]:
excel_df.describe()

              Price
count    365.000000
mean    6359.574241
std     4528.878870
min     1099.169125
25%     2585.349186
50%     4594.987850
75%     9182.843333
max    19498.683333

In [88]:
excel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    datetime64[ns]
 1   Price      365 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 5.8 KB

In [89]:
excel_df.tail(5)

     Timestamp        Price
360 2018-03-28  7960.380000
361 2018-03-29  7172.280000
362 2018-03-30  6882.531667
363 2018-03-31  6935.480000
364 2018-04-01  6794.105000

In [90]:
excel_df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [91]:
pd.to_datetime(excel_df['Timestamp'])

0     2017-04-02
1     2017-04-03
2     2017-04-04
3     2017-04-05
4     2017-04-06
         ...
360   2018-03-28
361   2018-03-29
362   2018-03-30
363   2018-03-31
364   2018-04-01
Name: Timestamp, Length: 365, dtype: datetime64[ns]

In [92]:
excel_df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [93]:
# excel_df.set_index(excel_df['Timestamp'])
excel_df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [94]:
excel_df.set_index('Timestamp', inplace=True)

In [95]:
excel_df.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

In [96]:
excel_df.loc['2017-5-09']

Price    1721.284971
Name: 2017-05-09 00:00:00, dtype: float64

In [121]:
excel_df["Ether"] = pd.Series(np.random.randint(1, 400, dtype=int))
# excel_df.plot(figsize=(5, 5))
excel_df

                  Price  Ether
Timestamp
2017-04-02  1099.169125    NaN
2017-04-03  1141.813000    NaN
2017-04-04  1141.600363    NaN
2017-04-05  1133.079314    NaN
2017-04-06  1196.307937    NaN
...                 ...    ...
2018-03-28  7960.380000    NaN
2018-03-29  7172.280000    NaN
2018-03-30  6882.531667    NaN
2018-03-31  6935.480000    NaN
2018-04-01  6794.105000    NaN

[365 rows x 2 columns]

In [99]:
excel_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 365 entries, 2017-04-02 to 2018-04-01
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Price   365 non-null    float64
dtypes: float64(1)
memory usage: 15.7 KB